[
  {
    "id": 18,
    "name": "The One Piece, vol. 1",
    "author": "Eiichiro Oda",
    "price": 22.99,
    "oldPrice": null,
    "description": "As a child, Monkey D. Luffy dreamed of becoming King of the Pirates. But his life changed when he accidentally gained the power to stretch like rubber…at the cost of never being able to swim again! Years, later, Luffy sets off in search of the “One Piece,” said to be the greatest treasure in the world...",
    "starRate": 4.8,
    "reviewCount": 5819,
    "stock": 321,
    "imgSource": "assets/images/books/theonepieceweb.jpg",
    "type": "Adventure"
  },
  {
    "id": 19,
    "name": "Hunter x Hunter, vol. 1",
    "author": "Yoshihiro Togashi",
    "price": 13.29,
    "oldPrice": null,
    "description": "Hunters are a special breed, dedicated to tracking down treasures, magical beasts, and even other people. But such pursuits require a license, and less than one in a hundred thousand can pass the grueling qualification exam. Those who do pass gain access to restricted areas, amazing stores of information, and the right to call themselves Hunters.",
    "starRate": 4.8,
    "reviewCount": 173,
    "stock": 73,
    "imgSource": "assets/images/books/hunterxhunterweb.jpg",
    "type": "Adventure"
  },

  {
    "id": 20,
    "name": "Fullmetal Alchemist",
    "author": "Shirow Masamune",
    "price": 24.90,
    "oldPrice": null,
    "description": "Edward and Alphonse Elric s reckless disregard for alchemy s fundamental laws ripped half of Ed s limbs from his body and left Al s soul clinging to a cold suit of armor. To restore what was lost, the brothers scour a war-torn land for the Philosopher s Stone: a fabled relic which grants the ability to perform alchemy in impossible ways.",
    "starRate": 4.5,
    "reviewCount": 189,
    "stock": 89,
    "imgSource": "assets/images/books/fullmentalwweb.jpg",
    "type": "Adventure"
  },
  {
    "id": 21,
    "name": "Naruto, vol. 1",
    "author": "Masashi Kishimoto",
    "price": 19.99,
    "oldPrice": null,
    "description": "Naruto is a young shinobi with an incorrigible knack for mischief. He’s got a wild sense of humor, but Naruto is completely serious about his mission to be the world’s greatest ninja! Twelve years ago the Village Hidden in the Leaves was attacked by a fearsome threat. A nine-tailed fox spirit claimed the life of the village leader, the Hokage, and many others",
    "starRate": 4.9,
    "reviewCount": 900,
    "stock": 80,
    "imgSource": "assets/images/books/narutoweb.jpg",
    "type": "Adventure"
  },
  {
    "id": 22,
    "name": "Attack on Titan 1",
    "author": "Hajime Isayama",
    "price": 34.99,
    "oldPrice": null,
    "description": "In this post-apocalytpic sci-fi story, humanity has been devastated by the bizarre, giant humanoids known as the Titans. Little is known about where they came from or why they are bent on consuming mankind. Seemingly unintelligent, they have roamed the world for years, killing everyone they see.",
    "starRate": 4.8,
    "reviewCount": 250,
    "stock": 14,
    "imgSource": "assets/images/books/attackontitanweb.jpg",
    "type": "Adventure"
  },
  {
    "id": 23,
    "name": "Dragon Ball, vol. 1",
    "author": "Akira Toriyama",
    "price": 52.29,
    "oldPrice": null,
    "description": "In keeping with the original Japanese format, this book reads from back to front and from right to left.",
    "starRate": 4.7,
    "reviewCount": 480,
    "stock": 490,
    "imgSource": "assets/images/books/dragonballweb.jpg",
    "type": "Adventure"
  },
  {
    "id": 24,
    "name": "Fairy Tail 1",
    "author": "Hiro Mashima",
    "price": 24.6,
    "oldPrice": null,
    "description": "Cute girl wizard Lucy wants to join the Fairy Tail, a club for the most powerful wizards. But instead, her ambitions land her in the clutches of a gang of unsavory pirates le by a devious magician. Her only hope is Natsu, a strange boy she happens to meet on her travels. Natsu’s not your typical hero – he gets motion sickness, eats like a pig, and his best friend is a talking cat. With friends like this, is Lucy better off with her enemies?",
    "starRate": 4.7,
    "reviewCount": 930,
    "stock": 143,
    "imgSource": "assets/images/books/fairytailweb.jpg",
    "type": "Adventure"
  },
  {
    "id": 1,
    "name": "Toradora",
    "author": "Yuyuko Takemiya",
    "price": 19.90,
    "oldPrice": null,
    "description": "The original light novel that inspired the hit manga and anime series!",
    "starRate": 4.8,
    "reviewCount": 1938,
    "stock": 1881,
    "imgSource": "assets/images/toradoraweb.jpg",
    "type": "Romance"
  },
  {
    "id": 3,
    "name": "Your Name",
    "author": "Robert T. Kiyosaki ",
    "price": 24.09,
    "oldPrice": null,
    "description": "A story of two people determined to hold on to one another.Mitsuha, a high school girl from a town deep in the mountains, dreams of an unfamiliar life in Tokyo. Taki, a high school boy from Tokyo, dreams that he is a girl living in the mountains. As the two begin swapping lives, a miraculous story is set in motion.",
    "starRate": 4.2,
    "reviewCount": 130,
    "stock": 3,
    "imgSource": "assets/images/books/yournameweb.jpg",
    "type": "Romance"
  },
  {
    "id": 4,
    "name": "Kaguya-Sama: Love is war",
    "author": "VIZ media LLC",
    "price": 25.89,
    "oldPrice": null,
    "description": "As leaders of their prestigious academy’s student council, Kaguya and Miyuki are the elite of the elite! But it’s lonely at the top… Luckily for them, they’ve fallen in love! There’s just one problem—they both have too much pride to admit it. And so begins the daily scheming to get the object of their affection to confess their romantic feelings first…",
    "starRate": 4.8,
    "reviewCount": 560,
    "stock": 6,
    "imgSource": "assets/images/books/kaguyasamaweb.jpg",
    "type": "Romance"
  },
  {
    "id": 5,
    "name": "Horimiya",
    "author": "Yen Press",
    "price": 9.99,
    "oldPrice": null,
    "description": "A sweet aww-inspiring tale of school life begins!!At school, Kyouko Hori is known for being smart, attractive, and popular. On the other hand, her classmate, the boring, gloomy Izumi Miyamura tends to get painted as a loser fanboy. But when a liberally pierced and tattooed (not to mention downright gorgeous) Miyamura appears unexpectedly on the doorstep of secretly plain-Jane homebody Hori, these two similarly dissimilar teenagers discover that there are multiple sides to every story...and person!",
    "starRate": 4.8,
    "reviewCount": 410,
    "stock": 450,
    "imgSource": "assets/images/books/horimiyaweb.jpg",
    "type": "Romance"
  },
  {
    "id": 7,
    "name": "My Youth Romantic Comedy",
    "author": "Yen On",
    "price": 13.29,
    "oldPrice": null,
    "description": "Hachiman Hikigaya is a cynic. Youth is a crock, he believes--a sucker's game, an illusion woven from failure and hypocrisy. But when he turns in an essay for a school assignment espousing this view, he's sentenced to work in the Service Club, an organization dedicated to helping students with problems in their lives! How will Hachiman the Cynic cope with a job that requires--gasp!--optimism?",
    "starRate": 4.3,
    "reviewCount": 173,
    "stock": 73,
    "imgSource": "assets/images/books/myyouthromanticweb.jpg",
    "type": "Romance"
  },

  {
    "id": 8,
    "name": "Steins Gate",
    "author": "5BP and Nitroplus",
    "price": 16.99,
    "oldPrice": null,
    "description": "What do you get when you cross a microwave with acell phone? Apparently, a time machine! Self-proclaimed mad scientist Okarin andthe Future Gadgets team now have the ability send text messages into the past.Will this new found power be used for personal gain? To change the world? Or forsomething much more sinister...?",
    "starRate": 4.3,
    "reviewCount": 189,
    "stock": 89,
    "imgSource": "assets/images/books/sreinsgateweb.jpg",
    "type": "Science Fiction"
  },
  {
    "id": 9,
    "name": "The Ghost in the Shell 1",
    "author": "Shirow Masamune",
    "price": 19.99,
    "oldPrice": null,
    "description": "Deep into the twenty-first century, the line between man and machine has been inexorably blurred as humans rely on the enhancement of mechanical implants and robots are upgraded with human tissue. In this rapidly converging landscape, cyborg superagent Major Motoko Kusanagi is charged to track down the craftiest and most dangerous terrorists and cybercriminals, including “ghost hackers” who are capable of exploiting the human/machine interface and reprogramming humans to become puppets to carry out the hackers’ criminal ends.",
    "starRate": 4.6,
    "reviewCount": 900,
    "stock": 80,
    "imgSource": "assets/images/books/theghostintheshellweb.jpg",
    "type": "Science Fiction"
  },
  {
    "id": 10,
    "name": "Psycho Pass: Inspector Shinya",
    "author": "Midori Gotu",
    "price": 34.99,
    "oldPrice": null,
    "description": "In this prequel to the hit science fiction crime drama anime series, Psycho-Pass: Inspector Shinya Kogami reveals how the legendary Enforcer was once an ace detective! Working within the city-regulating Sybil System, Inspectors must fight crime in a future where a single number measures your criminal tendencies and determines if you are useful to society!",
    "starRate": 4.7,
    "reviewCount": 250,
    "stock": 14,
    "imgSource": "assets/images/books/psychopassweb.jpg",
    "type": "Science Fiction"
  },
  {
    "id": 11,
    "name": "Cowboy Bebop #1",
    "author": "Hajime Yadate",
    "price": 52.29,
    "oldPrice": null,
    "description": "Follows the adventures of galactic bounty hunters, Spike, Jet, Faye, Ed, and Ein.",
    "starRate": 4.5,
    "reviewCount": 480,
    "stock": 490,
    "imgSource": "assets/images/books/cowboybebopweb.jpg",
    "type": "Science Fiction"
  },
  {
    "id": 12,
    "name": "Ergo Proxy",
    "author": "Karen Thompson",
    "price": 24.6,
    "oldPrice": null,
    "description": " ",
    "starRate": 4.6,
    "reviewCount": 930,
    "stock": 143,
    "imgSource": "assets/images/books/ergoproxyweb.jpg",
    "type": "Science Fiction"
  },
  {
    "id": 15,
    "name": "I am Hero Omnibus",
    "author": "Phirip R. Simon ",
    "price": 14.09,
    "oldPrice": null,
    "description": "The zombie apocalypse has never been more surreal! A mentally unhinged manga artist witnesses the beginning of a zombie outbreak in Tokyo, and he's certain of only two things: he's destined to be the city's hero, and he possesses something very rare in Japan--an actual firearm! Kengo Hanazawa's award-winning series comes to Dark Horse, and this realistically-drawn international bestseller takes us from initial small battles for survival to a huge, body-horror epidemic that threatens all of humanity!",
    "starRate": 4.4,
    "reviewCount": 130,
    "stock": 3,
    "imgSource": "assets/images/books/iamheroweb.jpg",
    "type": "Horror"
  },
  {
    "id": 16,
    "name": "The Kurosagi Corpse Delivery",
    "author": "Eiji Otsuka",
    "price": 25.89,
    "oldPrice": null,
    "description": "As leaders of their prestigious academy’s student council, Kaguya and Miyuki are the elite of the elite! But it’s lonely at the top… Luckily for them, they’ve fallen in love! There’s just one problem—they both have too much pride to admit it. And so begins the daily scheming to get the object of their affection to confess their romantic feelings first…",
    "starRate": 4.5,
    "reviewCount": 560,
    "stock": 6,
    "imgSource": "assets/images/books/thekurosagiweb.jpg",
    "type": "Horror"
  },
  {
    "id": 17,
    "name": "Hogurashi No Naku Koro",
    "author": "Yen Press",
    "price": 35.99,
    "oldPrice": null,
    "description": " ",
    "starRate": 4.0,
    "reviewCount": 410,
    "stock": 450,
    "imgSource": "assets/images/books/higurashiweb.jpg",
    "type": "Horror"
  }
]